flatPlate_Plenum/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          200;
        startFace       253240;
    }
    right
    {
        type            patch;
        nFaces          360;
        startFace       253440;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          200;
        startFace       253800;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       254000;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          900;
        startFace       254200;
    }
    cylinderInner
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       255100;
    }
    slot
    {
        type            patch;
        nFaces          60;
        startFace       255500;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          254400;
        startFace       255560;
    }
)

// ************************************************************************* //
