flatPlate_Plenum/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }

    right
    {
        type            fixedValue;
        value           uniform 0;
    }

    up
    {
        type            symmetryPlane;
    }

    left
    {
        type            fixedValue;
        value           uniform 0;
    }

    cylinder
    {
        type            zeroGradient;
    }

    cylinderInner
    {
        type            zeroGradient;
    }

    slot
    {
        type            fixedValue;
        value           uniform .01;

        // type                      plenumPressure;
        // value                     1e5;
        // gamma                     1.4;
        // R                         287;
        // supplyMassFlowRate        0.0005;
        // supplyTotalTemperature    300;
        // plenumVolume              0.0005;
        // plenumDensity             1;
        // plenumTemperature         300;
        // inletAreaRatio            1;
        // inletDischargeCoefficient 0.5;
        // rho                       1;
    }


    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
