flatPlate_Plenum/0/Co
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Co;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
119000
(
0.313423
0.314492
0.315483
0.316396
0.317231
0.317988
0.318666
0.319266
...
)
;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;
    }
    left
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    cylinderInner
    {
        type            zeroGradient;
    }
    slot
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
